export const seriesData = [{
        name: "北京",
        value: [116.24, 39.55, 100]
    },
    {
        name: "深圳",
        value: [114.271522, 22.753644]
    },
    {
        name: "重庆",
        value: [106.54, 29.59]
    },
    {
        name: "浙江",
        value: [120.19, 30.26]
    },
    {
        name: "上海",
        value: [121.4648, 31.2891]
    },
]


export const lableData = [{
        name: "北京",
        coords: [
            [116.24, 39.55],
            [121.24, 46.55]
        ], // 线条位置[开始位置，结束位置]
        value: [1021, 120]
    },
    {
        name: "深圳",
        coords: [
            [114.271522, 22.753644],
            [118.24, 18.55]
        ], // 线条位置[开始位置，结束位置]
        value: [1021, 120]
    },
    {
        name: "重庆",
        coords: [
            [106.54, 29.59],
            [104.24, 35.55]
        ], // 线条位置[开始位置，结束位置]
        value: [1021, 120]
    },
    {
        name: "浙江",
        coords: [
            [120.19, 30.26],
            [125.24, 27.55]
        ], // 线条位置[开始位置，结束位置]
        value: [1021, 120]
    },
    {
        name: "上海",
        coords: [
            [121.4648, 31.2891],
            [122.4648, 33.2891]
        ], // 线条位置[开始位置，结束位置]
        value: [1201, 60]
    },
]